logs/throughput_writes(2017-11-18_09h34)/ratio_1:0/sharded_false/workers_64/clients_4/client_3_1_2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       86827 ops,     991 (avg:     964) ops/sec, 1.01MB/sec (avg: 1002.76KB/sec),  4.02 (avg:  4.14) msec latency

1         Threads
4         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         964.71          ---          ---      4.13900      1002.76
Gets           0.00         0.00         0.00      0.00000         0.00
Waits          0.00          ---          ---      0.00000          ---
Totals       964.71         0.00         0.00      4.13900      1002.76


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       2.600         0.00
SET       2.700         0.09
SET       2.800         0.58
SET       2.900         1.87
SET       3.000         4.68
SET       3.100         9.30
SET       3.200        15.57
SET       3.300        22.99
SET       3.400        30.88
SET       3.500        38.96
SET       3.600        46.86
SET       3.700        53.55
SET       3.800        59.60
SET       3.900        64.74
SET       4.000        68.99
SET       4.100        72.31
SET       4.200        75.20
SET       4.300        77.62
SET       4.400        79.63
SET       4.500        81.35
SET       4.600        82.71
SET       4.700        83.96
SET       4.800        85.08
SET       4.900        86.06
SET       5.000        86.89
SET       5.100        87.62
SET       5.200        88.27
SET       5.300        88.88
SET       5.400        89.45
SET       5.500        90.02
SET       5.600        90.55
SET       5.700        91.02
SET       5.800        91.46
SET       5.900        91.90
SET       6.000        92.26
SET       6.100        92.67
SET       6.200        93.01
SET       6.300        93.28
SET       6.400        93.58
SET       6.500        93.88
SET       6.600        94.18
SET       6.700        94.45
SET       6.800        94.70
SET       6.900        94.97
SET       7.000        95.20
SET       7.100        95.40
SET       7.200        95.60
SET       7.300        95.82
SET       7.400        96.04
SET       7.500        96.23
SET       7.600        96.40
SET       7.700        96.56
SET       7.800        96.69
SET       7.900        96.83
SET       8.000        96.96
SET       8.100        97.07
SET       8.200        97.18
SET       8.300        97.29
SET       8.400        97.39
SET       8.500        97.47
SET       8.600        97.57
SET       8.700        97.64
SET       8.800        97.74
SET       8.900        97.82
SET       9.000        97.93
SET       9.100        98.01
SET       9.200        98.09
SET       9.300        98.16
SET       9.400        98.22
SET       9.500        98.30
SET       9.600        98.36
SET       9.700        98.42
SET       9.800        98.48
SET       9.900        98.54
SET      10.000        98.87
SET      11.000        99.31
SET      12.000        99.55
SET      13.000        99.75
SET      14.000        99.82
SET      15.000        99.89
SET      16.000        99.93
SET      17.000        99.97
SET      18.000        99.98
SET      19.000        99.98
SET      20.000        99.98
SET      21.000        99.99
SET      22.000        99.99
SET      23.000        99.99
SET      24.000        99.99
SET      27.000       100.00
SET      87.000       100.00
SET      88.000       100.00
---
---